#+TITLE: Data assimilation in financial time series data
#+STARTUP: hidestars
#+STARTUP: overview
#+LATEX_CLASS: myarticle
#+OPTIONS: toc:nil
#+STARTUP: inlineimages

** list of tuples as ouput of a function
#+BEGIN_SRC python :session :results output
import numpy as np
from itertools import permutations

def fn(i,j):
    a=np.random.randn(i,j)
    b=np.random.randn(i,j)
    return a+b,a*b
indices = list(range(4))
pairs = list(permutations(indices, 2))
res=[]
for i,(i1, i2) in enumerate(pairs):
    print(i1,i2)
    res.append(fn(i1,i2))

print(res[5][0])
#+END_SRC

#+RESULTS:
#+begin_example
0 1
0 2
0 3
1 0
1 2
1 3
2 0
2 1
2 3
3 0
3 1
3 2
[[1.37919918 2.57200128 1.70839453]]
#+end_example

** Calculo de medias y varianzas moviles pero usando exponential weiths 
#+BEGIN_SRC python :session :results output
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

def calculate_ewma_ewmv(time_series, alpha=0.2, initial_mean=None, initial_variance=None):
    """
    Calculate Exponentially Weighted Moving Average (EWMA) and
    Exponentially Weighted Moving Variance (EWMV) for a time series.
    
    Parameters:
    -----------
    time_series : array-like
        The input time series data
    alpha : float, optional (default=0.2)
        The smoothing factor, between 0 and 1
        - Higher alpha gives more weight to recent observations
        - Lower alpha results in more smoothing
    initial_mean : float, optional (default=None)
        Initial value for the mean. If None, uses the first value in the series
    initial_variance : float, optional (default=None)
        Initial value for the variance. If None, uses 0
        
    Returns:
    --------
    dict
        A dictionary containing:
        - 'original': original time series
        - 'ewma': exponentially weighted moving average
        - 'ewmv': exponentially weighted moving variance
    """
    # Convert input to numpy array for consistent handling
    data = np.array(time_series)
    n = len(data)
    
    # Initialize output arrays
    ewma = np.zeros(n)
    ewmv = np.zeros(n)
    
    # Set initial values
    if initial_mean is None:
        ewma[0] = data[0]
    else:
        ewma[0] = initial_mean
        
    if initial_variance is None:
        ewmv[0] = 0.0
    else:
        ewmv[0] = initial_variance
    
    # Calculate EWMA and EWMV iteratively
    for t in range(1, n):
        # Update EWMA
        ewma[t] = alpha * data[t] + (1 - alpha) * ewma[t-1]
        
        # Calculate squared deviation from the current EWMA
        squared_dev = (data[t] - ewma[t]) ** 2
        
        # Update EWMV
        ewmv[t] = alpha * squared_dev + (1 - alpha) * ewmv[t-1]
    
    return {
        'original': data,
        'ewma': ewma,
        'ewmv': ewmv
    }

# Example usage and visualization
def visualize_ewma_ewmv(time_series, alpha=0.2):
    """
    Calculate and visualize EWMA and EWMV for a given time series
    """
    results = calculate_ewma_ewmv(time_series, alpha)
    
    fig, (ax1, ax2) = plt.subplots(2, 1, figsize=(12, 8))
    
    # Plot time series and EWMA
    ax1.plot(results['original'], label='Original', color='gray', alpha=0.7)
    ax1.plot(results['ewma'], label=f'EWMA (α={alpha})', color='blue')
    ax1.set_title('Time Series with Exponentially Weighted Moving Average')
    ax1.legend()
    ax1.grid(True)
    
    # Plot EWMV
    ax2.plot(results['ewmv'], label=f'EWMV (α={alpha})', color='red')
    ax2.set_title('Exponentially Weighted Moving Variance')
    ax2.legend()
    ax2.grid(True)
    
    plt.tight_layout()
    plt.show()
    
    return results

# Example with synthetic data
if __name__ == "__main__":
    # Generate sample data with changing variance
    np.random.seed(42)
    n = 200
    
    # Create a time series with changing mean and variance
    regime1 = np.random.normal(0, 1, n//2)
    regime2 = np.random.normal(3, 2, n//2)
    combined_series = np.concatenate([regime1, regime2])
    
    # Test with different alpha values
    results = visualize_ewma_ewmv(combined_series, alpha=0.1)
#+END_SRC


**

#+BEGIN_SRC python :session :results output
import numpy as np
        mask = (arr[:, :-1] == False) & (arr[:, 1:] == True)
        indices = np.argwhere(mask)  # Get (row, col) indices where transition happens
        
        for row, col in indices:
            new_arr = np.zeros(shape, dtype=bool)  # Start with all False
            new_arr[row, col+1:] = True  # Set True after the transition
            transition_arrays.append(new_arr)

        new_arr = np.zeros_like(arr, dtype=bool)
        for j in range(arr.shape[1]):  # Iterate over columns
            # Find the first index where False turns into True
            transition_indices = np.where((arr[:-1, j] == False) & (arr[1:, j] == True))[0]
            if transition_indices.size > 0:
                new_arr[transition_indices[0] + 1 :, j] = True  # Set all rows after the transition to True

def generate_new_boolean_array(arr):
    # Ensure input is a boolean array
    arr = np.asarray(arr, dtype=bool)
    
    # Identify positions where False is followed by True
    mask = (arr[:-1] == False) & (arr[1:] == True)
    
    # Create output array (same length as input, default False)
    new_arr = np.zeros_like(arr, dtype=bool)
    
    # Set True at positions where False is followed by True
    new_arr[1:][mask] = True
    
    return new_arr

# Example usage
arr = np.array([True, False, False, True, False, True, True, False, True])
new_arr = generate_new_boolean_array(arr)
print(new_arr)

#+END_SRC

#+RESULTS:
: [False False False  True False  True False False  True]

#+BEGIN_SRC python :session :results output
import pandas as pd
import os
from datetime import datetime
import argparse
import numpy as np

def load_historical_prices(npz_filepath):
    """
    Carga los datos historicos de precios desde un archivo NPZ
    y los convierte a arrays de NumPy organizados.
    
    Parametros:
    - npz_filepath: Ruta al archivo NPZ generado por filter_historical_prices
    
    Retorna:
    - Un diccionario con los siguientes elementos:
      - 'fechas': Array de fechas como objetos datetime
      - 'precios': Array 2D con los precios (filas=fechas, columnas=tickers)
      - 'tickers': Lista de simbolos bursatiles
      - 'df': DataFrame de pandas con los datos organizados
      - 'metadata': Informacion adicional guardada en el archivo
    """
    try:
        # Cargar el archivo NPZ
        datos_cargados = np.load(npz_filepath, allow_pickle=True)
        
        # Extraer los arrays de datos
        fechas_array = datos_cargados['fechas']
        datos_array = datos_cargados['datos']
        tickers = datos_cargados['tickers']
        
        # Convertir las fechas de timestamps a objetos datetime
        fechas_datetime = pd.to_datetime(fechas_array)
        
        # Crear un DataFrame para facilitar la manipulacion
        df = pd.DataFrame(datos_array, columns=tickers)
        df.insert(0, 'Date', fechas_datetime)
        
        # Extraer metadata adicional
        metadata = {}
        for key in datos_cargados.files:
            if key not in ['fechas', 'datos', 'tickers']:
                metadata[key] = datos_cargados[key]
        
        # Organizar todos los datos en un diccionario de retorno
        resultado = {
            'fechas': fechas_datetime.values,
            'precios': datos_array,
            'tickers': tickers,
            'df': df,
            'metadata': metadata
        }
        
        print(f"Datos cargados exitosamente desde {npz_filepath}")
        print(f"Periodo: {fechas_datetime.min().strftime('%Y-%m-%d')} a {fechas_datetime.max().strftime('%Y-%m-%d')}")
        print(f"Tickers: {len(tickers)}")
        print(f"Registros: {len(fechas_datetime)}")
        
        return resultado
    
    except Exception as e:
        print(f"Error al cargar el archivo NPZ: {e}")
        return None
res=load_historical_prices('./dat/historical_prices_20000101_20250101.npz')
print('fechas: ',res['fechas'][:10])
print('precios: ',res['precios'].shape)
print('tickets: ',res['tickers'].shape)
print('tickets: ',res['tickers'][:10])

#+END_SRC

#+RESULTS:
#+begin_example
Datos cargados exitosamente desde ./dat/historical_prices_20000101_20250101.npz
Periodo: 2000-01-03 a 2024-12-31
Tickers: 28
Registros: 6289
fechas:  ['2000-01-03T00:00:00.000000000' '2000-01-04T00:00:00.000000000'
 '2000-01-05T00:00:00.000000000' '2000-01-06T00:00:00.000000000'
 '2000-01-07T00:00:00.000000000' '2000-01-10T00:00:00.000000000'
 '2000-01-11T00:00:00.000000000' '2000-01-12T00:00:00.000000000'
 '2000-01-13T00:00:00.000000000' '2000-01-14T00:00:00.000000000']
precios:  (6289, 28)
tickets:  (28,)
tickets:  ['APA.O' 'CCJ' 'CNX' 'COP' 'CRK' 'CTRA.K' 'CVX' 'DINO.K' 'DVN' 'EOG']
#+end_example

** Caso EM-filtro

Importa todas las librerias
#+BEGIN_SRC python :session :results output
import numpy as np, os
import matplotlib.pyplot as plt
import numpy.random as rnd
import dyn
import obs
import utils
#from enkf import FILTER
from em import FILTER as filternn
#+END_SRC

#+RESULTS:

Carga configuracion

#+BEGIN_SRC python :session :results output
class o_kwargs:
    H = obs. obsind2H([0,1,2],6)
    R = 2. * np.eye(3) 
#    H = obs. obsind2H([0,2],6)
#    R = 2. * np.eye(2) 
    swH=0

class conf:
    ncy=1000
    dtcy=0.02
    niter=40
    nem=100
    par0=np.zeros(3)
    rel_error=0.2
    mtd='em'  # 'enkf' 'em'
    fname='dat/gauss_em_Q0-0_r2'
    Q0=[0.1,0.0]
    #Q0=[0,0]#[1.,0.01]#[1.,0.01]
    finf=np.ones(6)#*1.05
    llast=0
    #finf[3:]=1.01
    #finf[0:3]=1.01
#+END_SRC

#+RESULTS:

Llama al EM.

#+BEGIN_SRC python :session :results output
   
def exp(o_kwargs,conf):
    
    Tmdl = dyn.augL63(dtcy=conf.dtcy,nem=conf.nem,par0=conf.par0,
                      rel_err=conf.rel_error,
                      )
    X0,xt0 = Tmdl.initialization()

    print('Generating observations')
    o_kwargs=utils.obj2dict(o_kwargs)
    Obs = obs.OBS(**o_kwargs)
    xt_t,y_t = Obs(xt0,conf.ncy,Tmdl)
    
    Q0diag=np.zeros(6)
    Q0diag[:3]=conf.Q0[0]
    Q0diag[3:]=conf.Q0[1]
        
    
    Filter=filternn(Tmdl,Obs,assmtd='perobs',xt_t=xt_t,
                  finf=conf.finf,Q0=np.diag(Q0diag),llast=conf.llast,
                  niter=conf.niter)
    #Xa_t,Xf_t=Filter(X0,y_t)

    res,rmse=Filter(X0,y_t)
    return xt_t,y_t,res,rmse

xt_t,y_t,res,rmse = exp(o_kwargs,conf)
#+END_SRC

#+RESULTS:
#+begin_example
Generating initial conditions
Climatology
Take initial condition from climatology
Generating observations
Lik:  -2781.241310299489
RMSE:  [ 4.34512414e-01  2.90644428e-01  2.54919549e-01  7.30433014e-02
  7.30433014e-02 -2.78124131e+03]
Lik:  -2702.515294601514
RMSE:  [ 3.88825652e-01  2.71866477e-01  7.65916139e-02  7.82856882e-02
  7.82856882e-02 -2.70251529e+03]
Lik:  -2696.7689603577005
RMSE:  [ 3.84965365e-01  2.66186981e-01  7.84814445e-02  7.83886110e-02
  7.83886110e-02 -2.69676896e+03]
Lik:  -2696.7014103729903
RMSE:  [ 3.85085931e-01  2.64121255e-01  7.83725268e-02  7.83636495e-02
  7.83636495e-02 -2.69670141e+03]
Lik:  -2690.727823905445
RMSE:  [ 3.84849028e-01  2.64806387e-01  7.83641982e-02  7.83652518e-02
  7.83652518e-02 -2.69072782e+03]
Lik:  -2687.9960546714115
RMSE:  [ 3.69995525e-01  2.57357638e-01  7.83646321e-02  7.83644669e-02
  7.83644689e-02 -2.68799605e+03]
Lik:  -2684.774151201283
RMSE:  [ 3.71367613e-01  2.53093208e-01  7.83645203e-02  7.83645496e-02
  7.83645496e-02 -2.68477415e+03]
Lik:  -2685.2074844921367
RMSE:  [ 3.66796547e-01  2.49056175e-01  7.83645620e-02  7.83645621e-02
  7.83645723e-02 -2.68520748e+03]
Lik:  -2683.12270639387
RMSE:  [ 3.68903617e-01  2.51666505e-01  7.83645757e-02  7.83645714e-02
  7.83645624e-02 -2.68312271e+03]
Lik:  -2682.0666825241005
RMSE:  [ 3.60081382e-01  2.38391164e-01  7.83645512e-02  7.83645474e-02
  7.83645538e-02 -2.68206668e+03]
Lik:  -2677.3736819271016
RMSE:  [ 3.60913751e-01  2.46956837e-01  7.83645371e-02  7.83645284e-02
  7.83645134e-02 -2.67737368e+03]
Lik:  -2676.15422646758
RMSE:  [ 3.56854385e-01  2.37138694e-01  7.83645763e-02  7.83645841e-02
  7.83646070e-02 -2.67615423e+03]
Lik:  -2672.998418803072
RMSE:  [ 3.60451301e-01  2.37477640e-01  7.83645724e-02  7.83645701e-02
  7.83645563e-02 -2.67299842e+03]
Lik:  -2669.192669337019
RMSE:  [ 3.53302880e-01  2.40356435e-01  7.83645956e-02  7.83646121e-02
  7.83646455e-02 -2.66919267e+03]
Lik:  -2671.7714715010616
RMSE:  [ 3.54815415e-01  2.36488872e-01  7.83645561e-02  7.83645543e-02
  7.83645539e-02 -2.67177147e+03]
Lik:  -2671.25544538335
RMSE:  [ 3.62637342e-01  2.35357502e-01  7.83645499e-02  7.83645463e-02
  7.83645409e-02 -2.67125545e+03]
Lik:  -2669.11489657432
RMSE:  [ 3.45412042e-01  2.28961588e-01  7.83645293e-02  7.83645205e-02
  7.83644973e-02 -2.66911490e+03]
Lik:  -2664.0211431725984
RMSE:  [ 3.43470122e-01  2.29135280e-01  7.83645561e-02  7.83645715e-02
  7.83646013e-02 -2.66402114e+03]
Lik:  -2669.4934108170332
RMSE:  [ 3.51551695e-01  2.29700541e-01  7.83645313e-02  7.83645308e-02
  7.83645271e-02 -2.66949341e+03]
Lik:  -2661.5462394125793
RMSE:  [ 3.41051233e-01  2.29946576e-01  7.83645728e-02  7.83645686e-02
  7.83645555e-02 -2.66154624e+03]
Lik:  -2665.8773597536438
RMSE:  [ 3.38813127e-01  2.19186848e-01  7.83645593e-02  7.83645633e-02
  7.83645892e-02 -2.66587736e+03]
Lik:  -2666.845629343488
RMSE:  [ 3.47152763e-01  2.28699830e-01  7.83645769e-02  7.83645689e-02
  7.83645441e-02 -2.66684563e+03]
Lik:  -2659.681912918478
RMSE:  [ 3.39858442e-01  2.22856189e-01  7.83646101e-02  7.83646210e-02
  7.83646345e-02 -2.65968191e+03]
Lik:  -2662.8908234107666
RMSE:  [ 3.38578391e-01  2.16412857e-01  7.83645585e-02  7.83645673e-02
  7.83645825e-02 -2.66289082e+03]
Lik:  -2661.512626386371
RMSE:  [ 3.34159608e-01  2.09034517e-01  7.83645900e-02  7.83646037e-02
  7.83646411e-02 -2.66151263e+03]
Lik:  -2659.71863195022
RMSE:  [ 3.37202892e-01  2.15377406e-01  7.83646197e-02  7.83646389e-02
  7.83646706e-02 -2.65971863e+03]
Lik:  -2655.856408825523
RMSE:  [ 3.36738738e-01  2.16428235e-01  7.83645884e-02  7.83646074e-02
  7.83646532e-02 -2.65585641e+03]
Lik:  -2658.346542307565
RMSE:  [ 3.30136705e-01  2.15016394e-01  7.83645892e-02  7.83645951e-02
  7.83646107e-02 -2.65834654e+03]
Lik:  -2662.2597381053984
RMSE:  [ 3.38496846e-01  2.14848750e-01  7.83645940e-02  7.83646038e-02
  7.83646364e-02 -2.66225974e+03]
Lik:  -2658.9364719618125
RMSE:  [ 3.35687508e-01  2.15211603e-01  7.83646205e-02  7.83646281e-02
  7.83646490e-02 -2.65893647e+03]
Lik:  -2659.2339309976433
RMSE:  [ 3.37397596e-01  2.10974579e-01  7.83645947e-02  7.83646073e-02
  7.83646409e-02 -2.65923393e+03]
Lik:  -2655.946334909959
RMSE:  [ 3.33193184e-01  2.10554194e-01  7.83645281e-02  7.83645111e-02
  7.83645034e-02 -2.65594633e+03]
Lik:  -2657.754334332294
RMSE:  [ 3.29367114e-01  2.05330549e-01  7.83646092e-02  7.83646153e-02
  7.83646349e-02 -2.65775433e+03]
Lik:  -2654.6887455026645
RMSE:  [ 3.28126834e-01  2.07286860e-01  7.83645960e-02  7.83646024e-02
  7.83646221e-02 -2.65468875e+03]
Lik:  -2658.4375745637003
RMSE:  [ 3.29964557e-01  2.02191597e-01  7.83645849e-02  7.83645884e-02
  7.83646092e-02 -2.65843757e+03]
Lik:  -2650.897301304035
RMSE:  [ 3.26479225e-01  2.03984394e-01  7.83645825e-02  7.83645879e-02
  7.83646106e-02 -2.65089730e+03]
Lik:  -2656.957413445
RMSE:  [ 3.33926405e-01  2.08058039e-01  7.83645811e-02  7.83645786e-02
  7.83645841e-02 -2.65695741e+03]
Lik:  -2650.049319704444
RMSE:  [ 3.29977908e-01  2.14290462e-01  7.83645691e-02  7.83645647e-02
  7.83645487e-02 -2.65004932e+03]
Lik:  -2650.588590508063
RMSE:  [ 3.24220350e-01  2.03764466e-01  7.83646078e-02  7.83646209e-02
  7.83646620e-02 -2.65058859e+03]
Lik:  -2651.1818012502667
RMSE:  [ 3.23398936e-01  2.03638609e-01  7.83645617e-02  7.83645473e-02
  7.83645273e-02 -2.65118180e+03]
Qvar:  [0.03183959 0.02405357 0.02740812]
Qpar:  [1.85343622e-17 1.79074633e-17 1.70680808e-17]
#+end_example

** Lectura de la hyperoptimizacion

#+BEGIN_SRC python :session :results output
import numpy as np
import pickle
with open('dat/hypero_kf_local.pkl', 'rb') as f:  # 'rb' = read binary
    dict = pickle.load(f)
print(dict['capital'].sum())
print(dict['idx_params'])
for idx in dict['idx_params']:
    print(dict['params'][idx])
with open('dat/hypero_kf_global.pkl', 'rb') as f:  # 'rb' = read binary
    dict = pickle.load(f)
print(dict['capital'])

#+END_SRC

#+RESULTS:
#+begin_example
8239.142655434714
[7 0 6 2 6 6 2 3 4 6 2 1 5 0 4 6 3 6 4 1 0 5 0 2 2 4 5 0 7 1 5 2 1 4 6 7 7
 0 5 7 1 3 4 2 3 7 4 7 0 2]

[7636.27206917 7618.69686615 7614.74133554 7570.59198252 7568.44197339]
#+end_example

